{
  "id": "7",
  "titulo": "Criptografia assimétrica",
  "data": "11/03/2023",
  "imagem": "img/padrao.webp",
  "descricao": "criptografia assimétrica é um tipo de criptografia que usa duas chaves diferentes para.............",
  "conteudo": "Olá, hoje vamos falar sobre criptografia assimétrica em PHP e sua importância para a Lei Geral de...<br>A criptografia assimétrica é um tipo de criptografia que usa duas chaves diferentes para criptografar e descriptografar informações. Isso significa que, ao contrário da criptografia simétrica, que usa a mesma chave para ambos os processos, a criptografia assimétrica permite que apenas a pessoa que tem a chave correta possa acessar a informação criptografada.<br>Em PHP, existem várias bibliotecas que suportam a criptografia assimétrica, como a biblioteca OpenSSL. Ela permite a geração de chaves públicas e privadas, além de fornecer funções para criptografar e descriptografar informações de maneira segura.<br>Mas por que a criptografia assimétrica é importante para a LGPD? A LGPD é uma lei brasileira que tem como objetivo proteger os dados pessoais dos cidadãos, garantindo que eles sejam tratados de forma adequada e segura. Isso inclui garantir que as informações não sejam acessadas por pessoas não autorizadas.<br>A criptografia assimétrica é importante para a LGPD porque permite proteger os dados pessoais durante o processo de transmissão, garantindo que apenas as pessoas autorizadas tenham acesso a eles. Além disso, ao usar a criptografia assimétrica, é possível garantir a integridade dos dados, o que significa que não é possível alterá-los sem que isso seja detectado.<br>um exemplo de como você pode utilizar a criptografia assimétrica para proteger o número de CPF em PHP:<br><pre>\n&lt;?php<br>// Gerar as chaves pública e privada<br>$config = array(<br>    'private_key_bits' => 2048,<br>    'private_key_type' => OPENSSL_KEYTYPE_RSA,<br>);<br>// Criar a chave privada<br>$privateKey = openssl_pkey_new($config);<br>// Extrair a chave pública a partir da chave privada<br>$publicKey = openssl_pkey_get_details($privateKey)['key'];<br>// Dados a serem criptografados (número de CPF)<br>$data = '123.456.789-10';<br>// Criptografar os dados com a chave pública<br>openssl_public_encrypt($data, $encryptedData, $publicKey);<br>// Descriptografar os dados com a chave privada<br>openssl_private_decrypt($encryptedData, $decryptedData, $privateKey);<br>criptografia/descriptografia<br>echo 'Dados originais: ' . $data . '\\n';<br>echo 'Dados criptografados: ' . base64_encode($encryptedData) . '\\n';<br>echo 'Dados descriptografados: ' . $decryptedData . '\\n';<br>openssl_free_key($privateKey);<br></pre><br>Neste exemplo, primeiro geramos as chaves pública e privada usando a biblioteca OpenSSL. Em seguida, criptografamos o número de CPF com a chave pública e, finalmente, descriptografamos os dados com a chave privada.<br>Observe que os dados criptografados são codificados em base64 para torná-los mais fáceis de armazenar ou transmitir. Além disso, é importante destacar que a criptografia assimétrica é uma técnica computacionalmente intensiva, por isso pode não ser apropriada para criptografar grandes volumes de dados.\nhá quem prefere criptografar direto no banco de dados, porém os dados ficam desprotegidos na transmissão, eu prefiro criptografar antes de armazenar, além disso é importante destacar que campo no banco de dados precisa ser do tipo 'text'.<br> nos dois jogos que criei o pedra papel e tesoura e o jogo de cartas multiplayer online estou utilizando essa criptografia para esconder o conteúdo ao enviar para o banco de dados, assim as mensagens ficam criptografadas, mas ela é descriptografada somente para o transmissor e receptor, pois as chaves são a composição do id da sala+nomedoprimeirojogador+nomedosegundojogador, e como o id da sala é um uuid (Um identificador único universal é um número de 128 bits usado para identificar informações em sistemas de computação.) sendo assim as mensagens só será lida pelos dois usuários naquela sala, e ao término do jogo a sala é excluída a mensagem se perde definitivamente."
}